Tekla Open API Reference for Tekla Structures 2025
AnalysisPartPositionProperties.KeepAxis Property
 The keep axis setting of the analysis part.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisModel.KeepAxisEnum KeepAxis { get; set; }
Public Property KeepAxis As AnalysisModel.KeepAxisEnum
	Get
	Set
Property Value
Type: AnalysisModel.KeepAxisEnum
See Also
Reference
AnalysisPartPositionProperties Class
Tekla.Structures.Analysis Namespace